app/controllers/registrations_controller.rb

	def create
	    @user = User.new(registration_params)
	    if @user.save(registration_params)
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)