app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save(user_params)
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "123456789"], ["phone", "123456789123"], ["updated_at", "2019-04-18 01:27:04.577521"], ["id", 4]]

  def destroy
    #complete this method
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 8]]